Revit 2027 API
IFCImportOptions.Intent Property
 The intent of the import.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IFCImportIntent Intent { get; set; }
Public Property Intent As IFCImportIntent
	Get
	Set
public:
property IFCImportIntent Intent {
	IFCImportIntent get ();
	void set (IFCImportIntent value);
}
member Intent : IFCImportIntent with get, set
Property Value
IFCImportIntent
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
IFCImportOptions Class
Autodesk.Revit.DB.IFC Namespace